import React, { useEffect, useState } from "react";
import school from "../../../images/homeimg.jpg";
import { media } from "../../media";
import { api } from "../../../http/api";

import tisher from "../../../images/tisher.jpg"
import stydent from "../../../images/stydent.jpg"


const Info = () => {
	const [modal, setModal] = useState(false);

	const [datas, setDatas] = useState([]);
	const [datas2, setDatas2] = useState([]);

	useEffect(() => {
		const fetchData = async () => {
			try {
				const { data } = await api.get("/quantity_students/");
				setDatas(data);
			} catch (error) {
				console.error("Error fetching data", error);
			}
		};

		fetchData();
	}, []);

	useEffect(() => {
		const fetchData = async () => {
			try {
				const { data } = await api.get("/quantity_teachers/");
				setDatas2(data);
			} catch (error) {
				console.error("Error fetching data", error);
			}
		};

		fetchData();
	}, []);

	return (
		<section id="info">
			<div className="container">
				<div className="info-general__width" />
				<div className="info-general">
					<div className="info-general__block">
						<div
							style={{
								width: media(250, 625),
								height: media(190, 438),
								margin: media(10, 25),
							}}
						/>
						<img
							src={school}
							alt="img"
							style={{ width: media(250, 625), height: media(190, 438) }}
						/>
					</div>
					<div className="info-general__block2">
						<h1>Факультет тууралуу маалымат</h1>
						{/*<p>СРЕДНЯЯ ОБЩЕОБРАЗОВАТЕЛЬНАЯ ШКОЛА №1.</p>*/}
						<div className="info-general__block2__gen">
							<div
								className="info-general__block2__gen__cer"
								style={{ width: media(70, 100), height: media(70, 100) }}>
								<img
									src={stydent}
									alt="img"
								/>
							</div>
							<div className="info-general__block2__gen__item">
								<h2>Учурдагы студенттер</h2>
								{datas.map((el, index) => (
									<h3 key={index}>{el.quantity_students}</h3>
								))}
							</div>
						</div>
						<div className="info-general__block2__gen">
							<div
								className="info-general__block2__gen__cer"
								style={{ width: media(70, 100), height: media(70, 100) }}>
								<img
									src={tisher}
									alt="img"
								/>
							</div>
							<div className="info-general__block2__gen__item">
								<h2>Учурдагы окутуучулар</h2>
								{datas2.map((el, index) => (
									<h3 key={index}>{el.quantity_teachers}</h3>
								))}
							</div>
						</div>
					</div>
				</div>
				<div className="info-general2">
					<button onClick={() => setModal(true)}>Толук маалымат</button>
					{modal && (
						<div className="info-general2__modal">
							<div className="info-general2__modal__block">
								<h1 onClick={() => setModal(false)}>Жабуу</h1>
								<p>
									МУЗЫКАЛЫК - ПЕДАГОГИКАЛЫК ФАКУЛЬТЕТИ Факультеттин тарыхы
									Музыкалык-педагогикалык факультет 1997-жылдын 25-февралында Ош
									жогорку колледжинин базасында уюштурулуп, жалпы билим берүүчү
									мектептер үчүн башталгыч класстардын мугалимдерин даярдоо
									максатын көздөгөн. 2006-жылы 16-январда Кыргыз Республикасынын
									билим берүү жана илим жана жаштар саясаты министрлигинин
									буйругунун негизинде музыкалык бөлүм педагогика факультетине
									бириктирилип, музыкалык-педагогикалык факультети болуп
									түзүлгөн. Факультеттин алгачкы жетекчилери: Мадраимов Сапарбек
									Мадраимович, педагогика илимдеринин кандидаты, профессор –
									1998-2000 Кенжебаев Азамат Арстаналиевич, биология илимдеринин
									кандидаты, доцент– 2000-2004 Ободоева Күмүшай Сансызбаевна,
									физика-математика илимдеринин кандидаты, доцент – 2004-2005
									Ысмайылов Мухтар Зулпукарович, педагогика илимдеринин
									кандидаты, доцент– 2005-2015 Бүгүнкү күндө
									музыкалык-педагогикалык факультетинин деканы п.и.к., доцент
									Миңбаева Кундускан Бодоновна жетектеп келет.
									Музыкалык-педагогикалык факультетинде окутуунун сапатын
									жогорулатуу максатында “Билим берүү” мыйзамдарынын, Кыргыз
									Республикасынын Билим берүү жана илим министрлигинин
									буйруктарынын негизинде ОшМПУ Музыкалык-педагогикалык
									факультети билим берүү ишмердүүлугүн Кыргыз Республикасынын
									нормативдик-укуктук актыларын жана окуу жайдын уставынын
									негизинде иш жүргүзөт. Факультетте эмгектенген окутуучулар
									окуу жүктөмдөр менен толук камсыз болгон. Окуу жүктөмдөрүн
									бөлүштурүүдө кабыл алынган норма эске алынган. Окуу планынын
									негизинде окуу процессинин графиги түзүлүп бекитилген,
									сабактардын жадыбалдары, семестрдик пландар иштелип чыгып,
									макулдашылып, бекитилип, AVNге жүктөлгөн жана алардын
									негизинде иштер аткарылып келүүдө. Учурда окуу жайдын эң ири
									факультеттеринин бири. Бүгүнкү күндө 3537 студент сапаттуу
									билим алып келүүдө. Эң мыкты окуган, окуу жайдын коомдук,
									маданий-массалык иштерине жана спартакияларына активдүү
									катышкан студенттер материалдык жана моралдык колдоолорго ээ
									болуп келишет. Факультетте жылына 500го жакын бүтүрүүчүлөр
									мамлекеттик сынактарын ийгиликтүү тапшырышып, жогорку окуу
									жайдын мамлекеттик үлгүдөгү дипломдоруна ээ болуу менен
									республикабыздын билим берүү тармагында үзүрлүү
									эмгектенишүүдө. Факультетте 3 кафедра төмөндөгүдөй курамда:
									Педагогика жана психология кафедрасы. Кафедрада жалпы 23
									окутуучу бар, анын ичинен 1 көмөкчү илимдин кандидаты, 1
									сырткы көмөкчү, 6 штаттык илимдин кандидаты жана, 5 улук
									окутуучу, 10 штаттык окутуучу жана 1лаборант бар. “Башталгыч,
									мектепке чейинки билим берүүнүн теориясы жана усулу” кафедрада
									жалпысы болуп 25 окутуучу иштейт. Алардын ичинен 3 илимдин
									кандитаты, 4 ага окутуучу, 8 окутуучу, 1 лаборант, көмөкчү 3
									илимдин доктору, 6 көмөкчү илимдин кандидаты. “Музыкалык билим
									берүү жана аны окутуунун усулу” кафедрада жалпы курамы -31,
									анын ичинен сырткы көмөкчүлөр - 7, сырттан келген көмөкчү
									наамы бар профессордук окутуучулук курамдын саны-1, магистр-5,
									улук окутуучу-5, окутуучу 11, улук лаборант-1, лаборант
								</p>
							</div>
						</div>
					)}
				</div>
			</div>
		</section>
	);
};

export default Info;
