import ChronologyImg1 from "../../images/ChronologyImg1.png"

export const chronologyData = [
    {
        img: ChronologyImg1,
        title: "“Алиппе майрамы”",
        data: "12.05.2022",
        class: "1-Б класс",
        teacher: "Баланчаева Баланча",
        description: "4 (16) ноября 1836 года городская почта доставила Пушкину и нескольким его друзьям анонимный пасквиль на французском языке, в котором Пушкину присваивался «патент на звание рогоносца»; в этой пародийной орденской грамоте содержался тонкий намёк на внимание к Н. Н. Пушкиной со стороны не только Дантеса, но и самого императора. ",
        descriptionInfo: "В 1927 году пушкинистами (Б. В. Казанским и П. Е. Рейнботом) было высказано предположение, что пасквиль указывает на мнимую связь Натальи Николаевны с императором, так как Пушкин назван заместителем Нарышкина, мужа Марии Нарышкиной, любовницы Александра I; эту точку зрения поддержал и автор наиболее авторитетного на то время исследования дуэли П. Е. Щёголев"
    },
    {
        img: ChronologyImg1,
        title: "“Алиппе майрамы”",
        data: "12.05.2022",
        class: "1-Б класс",
        teacher: "Баланчаева Баланча",
        description: "4 (16) ноября 1836 года городская почта доставила Пушкину и нескольким его друзьям анонимный пасквиль на французском языке, в котором Пушкину присваивался «патент на звание рогоносца»; в этой пародийной орденской грамоте содержался тонкий намёк на внимание к Н. Н. Пушкиной со стороны не только Дантеса, но и самого императора. ",
        descriptionInfo: "В 1927 году пушкинистами (Б. В. Казанским и П. Е. Рейнботом) было высказано предположение, что пасквиль указывает на мнимую связь Натальи Николаевны с императором, так как Пушкин назван заместителем Нарышкина, мужа Марии Нарышкиной, любовницы Александра I; эту точку зрения поддержал и автор наиболее авторитетного на то время исследования дуэли П. Е. Щёголев"
    },
    {
        img: ChronologyImg1,
        title: "“Алиппе майрамы”",
        data: "12.05.2022",
        class: "1-Б класс",
        teacher: "Баланчаева Баланча",
        description: "4 (16) ноября 1836 года городская почта доставила Пушкину и нескольким его друзьям анонимный пасквиль на французском языке, в котором Пушкину присваивался «патент на звание рогоносца»; в этой пародийной орденской грамоте содержался тонкий намёк на внимание к Н. Н. Пушкиной со стороны не только Дантеса, но и самого императора. ",
        descriptionInfo: "В 1927 году пушкинистами (Б. В. Казанским и П. Е. Рейнботом) было высказано предположение, что пасквиль указывает на мнимую связь Натальи Николаевны с императором, так как Пушкин назван заместителем Нарышкина, мужа Марии Нарышкиной, любовницы Александра I; эту точку зрения поддержал и автор наиболее авторитетного на то время исследования дуэли П. Е. Щёголев"
    },
]